# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### e_commerce Schema:

![e_commerce%20_schema.png](attachment:e_commerce%20_schema.png)

### Load Required Libraries

In [1]:
import mysql.connector

### Connect to DB using Mysql-connector-python package

In [2]:
myDB= mysql.connector.connect(host="localhost", user="root", password="Mahakaal@123")

### You are required to create a database named 'e_commerce'

In [4]:
myCursor = myDB.cursor()
myCursor.execute("CREATE DATABASE e_Commerce")

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [5]:
myCursor.execute("use e_Commerce")
myCursor.execute("create table supplier (SUPP_ID int not null auto_increment, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10), primary key (SUPP_ID));")
myCursor.execute("create table customer(CUS_ID int not null auto_increment, CUS_NAME varchar(50), CUS_PHONE varchar(10), CUS_CITY varchar(30), CUS_GENDER char, primary key (CUS_ID));")
myCursor.execute ("create table category (CAT_ID int not null auto_increment, CAT_NAME varchar(20), primary key (CAT_ID));")
myCursor.execute("create table product (PRO_ID int not null auto_increment, PRO_NAME varchar(20), PRO_DESC varchar(60), CAT_ID int not null, primary key(PRO_ID), foreign key (CAT_ID) references category(CAT_ID));")
myCursor.execute("create table product_details(PROD_ID int not null auto_increment, PRO_ID int not null, SUPP_ID int not null, PROD_PRICE float, primary key (PROD_ID), foreign key (SUPP_ID) references supplier(SUPP_ID), foreign key (PRO_ID) references product(PRO_ID));")
myCursor.execute("create table orders( ORD_ID int not null auto_increment, ORD_AMOUNT float, ORD_DATE date, CUS_ID int not null, PROD_ID int not null, primary key (ORD_ID), foreign key (PROD_ID) references product_details(PROD_ID), foreign key(CUS_ID) references customer(CUS_ID));")
myCursor.execute("create table rating (RAT_ID int not null auto_increment, CUS_ID int not null, SUPP_ID int not null, RAT_RATSTARS int not null, primary key(RAT_ID), foreign key (CUS_ID) references customer (CUS_ID), foreign key (SUPP_ID) references supplier(SUPP_ID));")

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [6]:
# insert into supplier
SupplierQuery = "insert into supplier (SUPP_NAME, SUPP_CITY, SUPP_PHONE) VALUES (%s, %s, %s)"
SupplierValues = [("Rajesh Retails", "Delhi", "1234567890"),
                  ("Appario Ltd.", "Mumbai", "8963147032"),
                  ("Knome products", "Bangalore", "9785462315"),
                  ("Bansal Retails", "Kochi", "8975463285"),
                  ("Mittal Ltd.", "Lucknow", "7898456532")]
myCursor.executemany(SupplierQuery, SupplierValues)
myDB.commit()

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [7]:
# insert into "customer" table
CustomerQuery = "insert into customer (CUS_NAME, CUS_PHONE, CUS_CITY, CUS_GENDER) VALUES (%s, %s, %s, %s)"
CustomerValues = [("AAKASH", "9999999999", "DELHI", "M"),
                  ("AMAN", "9785463215", "NOIDA", "M"),
                  ("NEHA", "9999999998", "MUMBAI", "F"),
                  ("MEGHA", "9994562399", "KOLKATA", "F"),
                  ("PULKIT", "7895999999", "LUCKNOW", "M" )]
myCursor.executemany(CustomerQuery, CustomerValues)
myDB.commit()

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [8]:
# insert into "categoty" table
CategoryQuery = "insert into category (CAT_NAME) VALUES ('BOOKS'),('GAMES'), ('GROCERIES'), ('ELECTRONICS'), ('CLOTHES')"

myCursor.execute(CategoryQuery)
myDB.commit()

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [9]:
# insert into "product" table
ProductQuery = "Insert into product (PRO_NAME, PRO_DESC, CAT_ID) VALUES (%s, %s, %s)"
ProductValues = [("GTA V", "DFJDJFDJFDJFDJFJF", 2),
                 ("TSHIRT", "DFDFJDFJDKFD", 5),
                 ("ROG LAPTOP", "DFNTTNTNTERND", 4),
                 ("OATS", "REURENTBTOTH", 3),
                 ("HARRY POTTER", "NBEMCTHTJTH", 1)]
myCursor.executemany(ProductQuery, ProductValues)
myDB.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [10]:
# insert into "product_details" table
ProductDetailsQuery = "Insert into product_details (PRO_ID, SUPP_ID, PROD_PRICE) VALUES (%s, %s, %s)"
ProductDetailsValues = [(1,2,1200),
                (3,5,30000),
                (5,1,3000),
                (2,3,2500),
                (4,1,1000)]
myCursor.executemany(ProductDetailsQuery, ProductDetailsValues)
myDB.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [11]:
# insert into "orders" table
OrdersQuery = "Insert into orders (ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID) VALUES (%s, %s, %s, %s)"
OrdersValues = [(1500, "2021-10-12", 3,5),
                       (30500, "2021-09-16", 5, 2),
                       (2000, "2021-10-05", 1,1),
                       (3500, "2021-08-16", 4, 3),
                       (2000, "2021-10-06", 2,1)]

myCursor.executemany(OrdersQuery, OrdersValues)
myDB.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [12]:
# insert into "rating" table
ratingQuery = "Insert into rating (CUS_ID, SUPP_ID, RAT_RATSTARS) VALUES (%s, %s, %s)"
ratingValues = [(2,2,4),
               (3,4,3),
               (5,1,5),
               (1,3,2),
               (4,5,4)]

myCursor.executemany(ratingQuery, ratingValues)
myDB.commit()

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [13]:
myCursor.execute ("SELECT customer.CUS_GENDER, COUNT(customer.CUS_ID) AS NumberOfCustomers FROM customer INNER JOIN orders ON customer.CUS_ID = orders.CUS_ID WHERE  (orders.ORD_AMOUNT > 3000) GROUP BY customer.CUS_GENDER") 
rows = myCursor.fetchall()
for row in rows:
    print(row)

('M', 1)
('F', 1)

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [14]:
myCursor.execute ("SELECT orders.ORD_ID, customer.CUS_ID, customer.CUS_Name, orders.ORD_DATE, product.PRO_NAME, orders.ORD_AMOUNT FROM orders INNER JOIN customer ON orders.CUS_ID = customer.CUS_ID INNER JOIN product_details ON orders.PROD_ID = product_details.PROD_ID INNER JOIN product ON product_details.PRO_ID = product.PRO_ID GROUP BY orders.ORD_ID, orders.ORD_AMOUNT, orders.ORD_DATE, product.PRO_NAME, customer.CUS_ID, customer.CUS_Name HAVING (customer.CUS_ID = 2)") 
rows = myCursor.fetchall()
for row in rows:
    print(row)

(5, 2, 'AMAN', datetime.date(2021, 10, 6), 'GTA V', 2000.0)

### Q5) Display the Supplier details who can supply more than one product.

In [15]:
myCursor.execute ("SELECT product_details.SUPP_ID, supplier.SUPP_NAME, supplier.SUPP_CITY, supplier.SUPP_PHONE FROM product_details INNER JOIN supplier ON product_details.SUPP_ID = supplier.SUPP_ID GROUP BY product_details.SUPP_ID, supplier.SUPP_NAME, supplier.SUPP_CITY, supplier.SUPP_PHONE HAVING (COUNT(product_details.PROD_ID) > 1)")
rows = myCursor.fetchall()
for row in rows:
    print(row)

(1, 'Rajesh Retails', 'Delhi', '1234567890')

### Q6) Find the category of the product whose order amount is minimum.

In [16]:
myCursor.execute ("SELECT category.CAT_NAME FROM orders INNER JOIN product_details ON orders.PROD_ID = product_details.PROD_ID INNER JOIN product ON product_details.PRO_ID = product.PRO_ID INNER JOIN category ON product.CAT_ID = category.CAT_ID WHERE  (orders.ORD_AMOUNT = (SELECT MIN(ORD_AMOUNT) AS Expr1 FROM orders AS orders_1))")
rows = myCursor.fetchall()
for row in rows:
    print(row)

('GROCERIES',)

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [17]:
myCursor.execute ("SELECT product.PRO_ID, product.PRO_NAME, product.PRO_DESC, product.CAT_ID FROM product INNER JOIN product_details ON product.PRO_ID = product_details.PRO_ID INNER JOIN orders ON product_details.PROD_ID = orders.PROD_ID WHERE  (orders.ORD_DATE > '2021-10-05')")
rows = myCursor.fetchall()
for row in rows:
    print(row)

(4, 'OATS', 'REURENTBTOTH', 3)
(1, 'GTA V', 'DFJDJFDJFDJFDJFJF', 2)

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [18]:
myCursor.execute ("SELECT supplier.SUPP_ID, supplier.SUPP_NAME, customer.CUS_Name, rating.RAT_RATSTARS FROM rating INNER JOIN customer ON rating.CUS_ID = customer.CUS_ID INNER JOIN supplier ON rating.SUPP_ID = supplier.SUPP_ID ORDER BY rating.RAT_RATSTARS DESC LIMIT 3")
rows = myCursor.fetchall()
for row in rows:
    print(row)

(1, 'Rajesh Retails', 'PULKIT', 5)
(2, 'Appario Ltd.', 'AMAN', 4)
(5, 'Mittal Ltd.', 'MEGHA', 4)

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [19]:
myCursor.execute ("SELECT CUS_Name FROM     customer WHERE  (CUS_Name LIKE 'A%') OR  (CUS_Name LIKE '%A') ")
rows = myCursor.fetchall()
for row in rows:
    print(row)

('AAKASH',)
('AMAN',)
('NEHA',)
('MEGHA',)

### Q10) Display the total order amount of the male customers.

In [20]:
myCursor.execute ("SELECT SUM(orders.ORD_AMOUNT) AS TotalORderValue FROM     orders INNER JOIN customer ON orders.CUS_ID = customer.CUS_ID GROUP BY customer.CUS_GENDER HAVING (customer.CUS_GENDER = 'M')")
rows = myCursor.fetchall()
for row in rows:
    print(row)

(34500.0,)

### Q11) Display all the Customers left outer join with  the orders

In [21]:
myCursor.execute ("SELECT customer.CUS_ID, customer.CUS_Name, customer.CUS_PHONE, customer.CUS_CITY, customer.CUS_GENDER, orders.ORD_ID, orders.ORD_AMOUNT, orders.ORD_DATE, orders.PROD_ID FROM     customer LEFT OUTER JOIN  orders ON customer.CUS_ID = orders.CUS_ID")
rows = myCursor.fetchall()
for row in rows:
    print(row)

(1, 'AAKASH', '9999999999', 'DELHI', 'M', 3, 2000.0, datetime.date(2021, 10, 5), 1)
(2, 'AMAN', '9785463215', 'NOIDA', 'M', 5, 2000.0, datetime.date(2021, 10, 6), 1)
(3, 'NEHA', '9999999998', 'MUMBAI', 'F', 1, 1500.0, datetime.date(2021, 10, 12), 5)
(4, 'MEGHA', '9994562399', 'KOLKATA', 'F', 4, 3500.0, datetime.date(2021, 8, 16), 3)
(5, 'PULKIT', '7895999999', 'LUCKNOW', 'M', 2, 30500.0, datetime.date(2021, 9, 16), 2)

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)